{"format": "keras", "nodes": [{"name": "vgg16_input", "id": "vgg16_input", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Functional", "output_shape": [null, 7, 7, 512], "num_parameters": 14714688}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 25088], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 3211392}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 129}], "edges": [["vgg16_input", "vgg16"], ["vgg16", "flatten"], ["flatten", "dense"], ["dense", "dense_1"]]}